package by.htp.itacademy.decomposition;


// Task #12
// 12. Даны числа X, Y, Z, Т — длины сторон четырехугольника. Написать метод(методы) вычисления его площади,
//    если угол между сторонами длиной X и Y— прямой.
public class DecompositionTask12 {

    public static void main(String[] args) {
        System.out.println("\n>> Task #12");
        // TODO

    }
}
