package by.htp.itacademy.linearprogramming;

public class LinearProgrammingP3 {
    public static void main(String[] args) {

    }

    // Task #21
    // Дано действительное (double) число R вида nnn.ddd (три цифровых
    // разряда в целой и дробной части). Поменять местами дробную
    // и целую части числа и вывести получнное значение.

    // Task #22
    // Дано натуральное число "Т", которое представляет длительность
    // прошедшего времени в секундах. Вывести данное значение
    // длительности в часах, минутах и секундах в следующей форме:
    // HHч MMмин SSс


    // Task #23
    // Найти площадь кольца, внутренний радиус которого равен
    // "r", а внешний -- "R" (R > r)



    // Task #24
    // Найти площадь равнобедренной трапеции с основаниями "a" и "b"
    // и углом "alpha" при большем основании "a"




    // Task #25
    // Вычислить корни квадратного уравнения a * x^2 + b * x + c = 0
    // с заданными коэффициентами a, b, c (предполагается, что a != 0 и
    // дискриминант уравнения неотрицателен)

    // Task #26
    // НАйти площадь треугольника, две стороны которого равны "a"и "b",
    // а угол между сторонами "y"

    // Task #27
    // Дано значение "a". Не используя никаких функций и никаких операций,
    // кроме умножения, получить значение a^3 за три операции и a^10 за четыре
    // операции

    // Task #28
    // Составить программу перевода радианной меры угла в градусы, минуты, секунды



    // Task #29
    // Найти (в радианах и градусах) все углы треугольника со сторонами
    // a, b, c


    // Task #30
    // Три сопротивления "R1", "R2" и "R3" соединены параллельно
    // Найдите сопротивление соединения
}
