package by.htp.itacademy.linearprogramming;

public class LinearProgrammingP2 {
    public static void main(String[] args) {

    }

    // Task #11
    // Вычислить периметр и площадь прямоугольного треугольника по длинам
    // a и b двух катетов
    private static void task11(double a, double b) {

        System.out.println("\n>> Task #11");

    }


    // Task #12
    // Вычислить расстояние между двумя точками с данными координатами
    // (x1, y1) и (x2, y2)
    private static void task12(double x1, double y1, double x2, double y2) {

        System.out.println("\n>> Task #12");

    }


    // Task #13
    // Заданы координаты 3-х вершин треугольника (x1, y2), (x2, y2), (x3, y3).
    // Найти его периметр и площадь
    private static void task13(double x1, double y1,
                              double x2, double y2,
                              double x3, double y3) {

        System.out.println("\n>> Task #13");

    }


    // Task #14
    // Вычислить длину окружности и площадь круга
    // одного и того же заданного радиуса R
    private static void task14(double r) {

        System.out.println("\n>> Task #14");
    }


    // Task #15
    // Написать программу, которая выводить на экран первые 4 степени числа "Пи"



    // Task #16
    // НАйти произведение цифр 4-значного числа

    // Task #17
    // Даны 2 числа. Найти среднее арифметическое кубов этих чисел и среднее
    // геометрическое модулей этих чисел


    // Task #18
    // Дана длина ребра куба. Найти площадь грани,
    // площадь полной поверхности, и объем этого куба
    //


    // Task #19
    // Дана сторона равностороннего треугольника. Найти площадь этого
    // треугольника, его высоту, радиусы вписанной и описанной окружности


    // Task #20
    // Дана длина окружности. Найти площадь круга, ограниченного
    // этой окружностью

}
