package by.htp.itacademy.linearprogramming;

public class LinearProgrammingP2 {
    public static void main(String[] args) {
    }

    // Task #11
    // Вычислить периметр и площадь прямоугольного треугольника по длинам
    // a и b двух катетов


    // Task #12
    // Вычислить расстояние между двумя точками с данными координатами
    // (x1, y1) и (x2, y2)


    // Task #13
    // Заданы координаты 3-х вершин треугольника (x1, y2), (x2, y2), (x3, y3).
    // Найти его периметр и площадь


    // Task #14
    // Вычислить длину окружности и площадь круга
    // одного и того же заданного радиуса R

    // Task #15
    // Написать программу, которая выводить на экран первые 4 степени числа "Пи"


    // Task #16
    // НАйти произведение цифр 4-значного числа

    // Task #17
    // Даны 2 числа. Найти среднее арифметическое кубов этих чисел и среднее
    // геометрическое модулей этих чисел


    // Task #18
    // Дана длина ребра куба. Найти площадь грани,
    // площадь полной поверхности, и объем этого куба
    //


    // Task #19
    // Дана сторона равностороннего треугольника. Найти площадь этого
    // треугольника, его высоту, радиусы вписанной и описанной окружности


    // Task #20
    // Дана длина окружности. Найти площадь круга, ограниченного
    // этой окружностью

}
