package by.htp.itacademy.multidimarray;

import by.htp.itacademy.util.Util;

public class MultiDimArrayP3 {

    public static void main(String[] args) {

//        task21();
//        task22();
//        task23();
//        task24();
//        task25();
//        task26();
//        task27();
//        task28();
//        task29();
//        task30();
    }


    // Task #21
// 21. Сформировать квадратную матрицу порядка n по заданному образцу(n - четное):
    private static void task21() {
        System.out.println("\n>> Task #21");
// TODO

    }

    // Task #22
// 22. Сформировать квадратную матрицу порядка n по заданному образцу(n - четное):
    private static void task22() {
        System.out.println("\n>> Task #22");
// TODO

    }


    // Task #23
// 23. Сформировать квадратную матрицу порядка N по правилу: и подсчитать количество положительных элементов в ней.
    private static void task23() {
        System.out.println("\n>> Task #23");
// TODO

    }


    // Task #24
// 24. Дан линейный массив x1, x2,, xn-1, xn . Получить действительную квадратную матрицу порядка n:
    private static void task24() {
        System.out.println("\n>> Task #24");
// TODO

    }


    // Task #25
// 25. Получить квадратную матрицу порядка n:
    private static void task25() {
        System.out.println("\n>> Task #25");
// TODO

    }


    // Task #26
// 26. С клавиатуры вводится двумерный массив чисел размерностью nxm. Выполнить с массивом следующие действия:
// а) вычислить сумму отрицательных элементов в каждой строке;
// б) определить максимальный элемент в каждой строке;
// в) переставить местами максимальный и минимальный элементы матрицы.
    private static void task26() {
        System.out.println("\n>> Task #26");
// TODO

    }


    // Task #27
// 27. В числовой матрице поменять местами два столбца любых столбца, т. е. все элементы одного столбца поставить на соответствующие им позиции другого, а его элементы второго переместить в первый. Номера столбцов вводит пользователь с клавиатуры.
    private static void task27() {
        System.out.println("\n>> Task #27");
// TODO

    }


    // Task #28
// 28. Задана матрица неотрицательных чисел. Посчитать сумму элементов в каждом столбце. Определить, какой столбец содержит максимальную сумму.
    private static void task28() {
        System.out.println("\n>> Task #28" );
// TODO

    }


    // Task #29
// 29. Найти положительные элементы главной диагонали квадратной матрицы.
    private static void task29() {
        System.out.println("\n>> Task #29");
// TODO

    }


    // Task #30
// 30. Матрицу 10x20 заполнить случайными числами от 0 до 15. Вывести на экран саму матрицу и номера строк, в которых число 5 встречается три и более раз.
    private static void task30() {
        System.out.println("\n>> Task #30");
// TODO

    }




}
