package by.htp.itacademy.conditions;

public class ConditionsBranchingP1 {

    public static void main(String[] args) {

//        task01(5, 8);
//        task02(6, 7);
//        task03();
//        task04();
//        task05();
//        task06();
//        task07();
//        task08();
//        task09();
//        task10();
    }

    // Task #01
    // 1. Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран цифру 7,
    // в противном случае – цифру 8.
    private static void task01(int x, int y) {

        System.out.println("\n>> Task #01");
        // TODO
    }


    // Task #02
    // 2. Составить программу сравнения двух чисел 1 и 2.
    // Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no»
    private static void task02(int x, int y) {

        System.out.println("\n>> Task #02");
        // TODO
    }


    // Task #03
    // 3. Составить программу сравнения введенного числа а и цифры 3.
    // Вывести на экран слово «yes», если число а меньше 3; если больше, то вывести слово «no».
    private static void task03(int x) {

        System.out.println("\n>> Task #03");
        // TODO
    }

    // Task #04
    // 4. Составить программу: равны ли два числа а и b?
    private static void task04(int a, int b) {

        System.out.println("\n>> Task #04");
        // TODO
    }

    // Task #05
    // 5. Составить программу: определения наименьшего из двух чисел а и b.
    private static void task05(int a, int b) {

        System.out.println("\n>> Task #05");
        // TODO
    }

    // Task #06
    // 6. Составить программу: определения наибольшего из двух чисел а и b.
    private static void task06(int a, int b) {

        System.out.println("\n>> Task #06");
        // TODO
    }


    // Task #07
    // 7. Составить программу нахождения модуля выражения
    // a*x*x + b*x + c при заданных значениях a, b, c и х
    private static void task07(int a, int b, int c, int x) {

        System.out.println("\n>> Task #07");
        // TODO
    }


    // Task #08
    // 8. Составить программу нахождения наименьшего
    // из квадратов двух чисел а и b.
    private static void task08(int a, int b) {

        System.out.println("\n>> Task #08");
        // TODO
    }


    // Task #09
    // 9. Составить программу, которая определит по трем введенным сторонам,
    // является ли данный треугольник равносторонним.
    private static void task09(double a, double b, double c) {

        System.out.println("\n>> Task #09");
        // TODO
    }


    // Task
    // 10. Составить программу, которая определит площадь какого круга меньше.
    private static void task10(double r1, double r2) {

        System.out.println("\n>> Task #10");
        // TODO
    }

}
