package by.htp.itacademy.conditions;

public class ConditionsBranchingP2 {

    public static void main(String[] args) {

//        task11();
//        task12();
//        task13();
//        task14();
//        task15();
//        task16();
//        task17();
//        task18();
//        task19();
//        task20();

    }

    // Task #11
    // 11. Составить программу, которая определит площадь какого треугольника больше.
    private static void task11(double x, double y) {

        System.out.println("\n>> Task #11");
        // TODO
    }


    // Task #12
    // 12. Даны три действительных числа. Возвести в квадрат те из них,
    // значения которых неотрицательны, и в четвертую
    // степень — отрицательные.
    private static void task12(double a, double b, double c) {

        System.out.println("\n>> Task #12");
        // TODO
    }


    // Task #13
    // 13. Даны две точки А(х1, у1) и В(х2, у2). Составить алгоритм, определяющий,
    // которая из точек находится ближе к
    // началу координат.
    private static void task13(double x1, double y1, double x2, double y2) {

        System.out.println("\n>> Task #13");
        // TODO
    }


    // Task #14
    // 14. Даны два угла треугольника (в градусах). Определить,
    // существует ли такой треугольник, и если да, то будет ли он
    // прямоугольным.
    private static void task14(double alpha, double betha) {

        System.out.println("\n>> Task #14");
        // TODO
    }

    // Task #15
    // 15. Даны действительные числа х и у, не равные друг другу.
    // Меньшее из этих двух чисел заменить половиной их
    // суммы, а большее — их удвоенным произведением.
    private static void task15(double x, double y) {

        System.out.println("\n>> Task #15");
        // TODO
    }

    // Task #16
    // 16. На плоскости ХОY задана своими координатами точка А.
    // Указать, где она расположена (на какой оси или в каком
    // координатном угле).
    private static void task16(double x, double y) {

        System.out.println("\n>> Task #16");
        // TODO
    }


    // Task #17
    // 17. Даны целые числа m, n. Если числа не равны, то заменить каждое
    // из них одним и тем же числом, равным большему
    // из исходных, а если равны, то заменить числа нулями.
    private static void task07(int m, int n) {

        System.out.println("\n>> Task #17");
        // TODO
    }


    // Task #18
    // 18. Подсчитать количество отрицательных среди чисел а, b, с.
    private static void task08(int a, int b, int c) {

        System.out.println("\n>> Task #18");
        // TODO
    }


    // Task #19
    // 19. Подсчитать количество положительных среди чисел а, b, с.
    private static void task19(double a, double b, double c) {

        System.out.println("\n>> Task #19");
        // TODO
    }


    // Task #20
    // 20. Определить, делителем каких чисел а, b, с является число k.
    private static void task10(int a, int b, int c, int k) {

        System.out.println("\n>> Task #20");
        // TODO
    }

}
