package by.htp.itacademy.conditions;

public class ConditionsBranchingP1 {

    public static void main(String[] args) {

    }


    // Task
    // 1. Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран цифру 7, в противном случае – цифру 8.


    // Task
    // 2. Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no»


    // Task
    // 3. Составить программу сравнения введенного числа а и цифры 3. Вывести на экран слово «yes», если число а меньше 3; если больше, то вывести слово «no».


    // Task
    // 4. Составить программу: равны ли два числа а и b?


    // Task
    // 5. Составить программу: определения наименьшего из двух чисел а и b.


    // Task
    // 6. Составить программу: определения наибольшего из двух чисел а и b.


    // Task
    // 7. Составить программу нахождения модуля выражения a*x*x + b*x + c при заданных значениях a, b, c и х


    // Task
    // 8. Составить программу нахождения наименьшего из квадратов двух чисел а и b.


    // Task
    // 9. Составить программу, которая определит по трем введенным сторонам, является ли данный треугольник равносторонним.


    // Task
    // 10. Составить программу, которая определит площадь какого круга меньше.


}
