package by.htp.itacademy.loops;

import static java.lang.Math.pow;

public class LoopsP3 {

    public static void main(String[] args) {
        task21();
        task22();
        task23();
        task24();
        task25();
        task26();
        task27();
        task28();
        task29();
        task30();

    }

    // Task #21
    // 21. Составить программу для вычисления значений функции F(x) на отрезке [а, b] с шагом h. Результат
    //представить в виде таблицы, первый столбец которой – значения аргумента, второй - соответствующие
    //значения функции:
    //F(x) = x −sin(x)
    private static void task21() {

        System.out.println("\n>> Task #21");
        // TODO
    }


    // Task #22
    //22. Составить программу для вычисления значений функции F(x) на отрезке [а, b] с шагом h. Результат
    //представить в виде таблицы, первый столбец которой – значения аргумента, второй - соответствующие
    //значения функции:
    //F(x) = sin2(x)
    private static void task22() {

        System.out.println("\n>> Task #22");
        // TODO
    }


    // Task #23
    // 23. Составить программу для вычисления значений функции F(x) на отрезке [а, b] с шагом h. Результат
    //представить в виде таблицы, первый столбец которой – значения аргумента, второй - соответствующие
    //значения функции:
    private static void task23() {

        // TODO

    }

    // Task #24
    // 24. Вводится натуральное число. Найти сумму четных цифр, входящих в его состав. Преобразовать
    // его в другое число, цифры которого будут следовать в обратном порядке по сравнению с введенным
    // числом.
    private static void task24() {

        System.out.println("\n>> Task #24");

        // TODO
    }


    // Task #25
    // 25. Требуется определить факториал числа, которое ввел пользователь.
    private static void task25() {

        System.out.println("\n>> Task #25");
        // TODO
    }


    // Task #26
    // 26. Вывести на экран соответствий между символами и их численными обозначениями в памяти
    // компьютера (Таблицу ASCII).
    private static void task26() {

        System.out.println("\n>> Task #26");
        // TODO
    }


    // Task #27
    // 27. Для каждого натурального числа в промежутке от m до n вывести все делители, кроме единицы и
    //самого числа. m и n вводятся с клавиатуры.
    private static void task27() {

        System.out.println("\n>> Task #27");
        // TODO
    }


    // Task #28
    // 28. Написать программу, в которой вводятся два операнда Х и Y и знак операции (+, –, /, *). Вычислить
    //результат Z в зависимости от знака. Предусмотреть реакции на возможный неверный знак операции, а
    //также на ввод Y=0 при делении. Организовать возможность многократных вычислений без
    //перезагрузки программа (т.е. построить цикл). В качестве символа прекращения вычислений принять
    //‘0’.
    private static void task28() {

        System.out.println("\n>> Task #28");
        // TODO
    }


    // Task #29
    // 29. Даны два числа. Определить цифры, входящие в запись как первого так и второго числа.
    private static void task29() {

        System.out.println("\n>> Task #29");
        // TODO
    }

    // Task #30
    // 30. Написать программу, переводящую римские цифры в арабские.
    private static void task30() {

        System.out.println("\n>> Task #30");
        // TODO
    }
}
